<a href="https://colab.research.google.com/github/Sarmen-Sinanian/DS-Unit-1-Sprint-2-Data-Wrangling-and-Storytelling/blob/master/Sarmen_Sinanian_121_Join_and_Reshape_Data.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Assignment

## Join Data Section

These are the top 10 most frequently ordered products. How many times was each ordered? 

1. Banana
2. Bag of Organic Bananas
3. Organic Strawberries
4. Organic Baby Spinach 
5. Organic Hass Avocado
6. Organic Avocado
7. Large Lemon 
8. Strawberries
9. Limes 
10. Organic Whole Milk

First, write down which columns you need and which dataframes have them.

Next, merge these into a single dataframe.

Then, use pandas functions from the previous lesson to get the counts of the top 10 most frequently ordered products.

## Reshape Data Section

- Replicate the lesson code
- Complete the code cells we skipped near the beginning of the notebook
- Table 2 --> Tidy
- Tidy --> Table 2
- Load seaborn's `flights` dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [1]:
!wget https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz

--2019-07-17 07:24:57--  https://s3.amazonaws.com/instacart-datasets/instacart_online_grocery_shopping_2017_05_01.tar.gz
Resolving s3.amazonaws.com (s3.amazonaws.com)... 52.216.147.77
Connecting to s3.amazonaws.com (s3.amazonaws.com)|52.216.147.77|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 205548478 (196M) [application/x-gzip]
Saving to: ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’

instacart_online_gr 100%[===================>] 196.03M  37.1MB/s    in 6.1s

2019-07-17 07:25:08 (32.4 MB/s) - ‘instacart_online_grocery_shopping_2017_05_01.tar.gz’ saved [205548478/205548478]

In [2]:
!tar --gunzip --extract --verbose --file=instacart_online_grocery_shopping_2017_05_01.tar.gz

instacart_2017_05_01/
instacart_2017_05_01/._aisles.csv
instacart_2017_05_01/aisles.csv
instacart_2017_05_01/._departments.csv
instacart_2017_05_01/departments.csv
instacart_2017_05_01/._order_products__prior.csv
instacart_2017_05_01/order_products__prior.csv
instacart_2017_05_01/._order_products__train.csv
instacart_2017_05_01/order_products__train.csv
instacart_2017_05_01/._orders.csv
instacart_2017_05_01/orders.csv
instacart_2017_05_01/._products.csv
instacart_2017_05_01/products.csv

In [3]:
ls

instacart_2017_05_01/                                sample_data/
instacart_online_grocery_shopping_2017_05_01.tar.gz

In [4]:
%cd instacart_2017_05_01

/content/instacart_2017_05_01

In [5]:
!ls -lh *.csv

-rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
-rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
-rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
-rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
-rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
-rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
import pandas as pd

In [0]:
aisles = pd.read_csv('aisles.csv')
departments = pd.read_csv('departments.csv')
order_products__prior = pd.read_csv('order_products__prior.csv')
order_products__train = pd.read_csv('order_products__train.csv')
orders = pd.read_csv('orders.csv')
products = pd.read_csv('products.csv')

In [8]:
aisles.head()
#no

   aisle_id                       aisle
0         1       prepared soups salads
1         2           specialty cheeses
2         3         energy granola bars
3         4               instant foods
4         5  marinades meat preparation

In [9]:
departments.head()
#no

   department_id department
0              1     frozen
1              2      other
2              3     bakery
3              4    produce
4              5    alcohol

In [10]:
order_products__prior.head()
#YES

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [11]:
order_products__prior.shape

(32434489, 4)

We need from order_products__prior.csv:


*   product_id
*   order_id

In [12]:
order_products__train.head()
#YES

   order_id  product_id  add_to_cart_order  reordered
0         1       49302                  1          1
1         1       11109                  2          1
2         1       10246                  3          0
3         1       49683                  4          0
4         1       43633                  5          1

In [13]:
order_products__train.shape,

((1384617, 4),)

We need from order_products__train.csv:

*   product_id
*   order_id

In [14]:
orders.head()
#no

   order_id  user_id  ... order_hour_of_day  days_since_prior_order
0   2539329        1  ...                 8                     NaN
1   2398795        1  ...                 7                    15.0
2    473747        1  ...                12                    21.0
3   2254736        1  ...                 7                    29.0
4    431534        1  ...                15                    28.0

[5 rows x 7 columns]

In [15]:
orders.shape

(3421083, 7)

In [16]:
products.head()
#YES

   product_id  ... department_id
0           1  ...            19
1           2  ...            13
2           3  ...             7
3           4  ...             1
4           5  ...            13

[5 rows x 4 columns]

In [17]:
products.shape

(49688, 4)

##Concatenate order_products__prior.csv and order_products__train.csv columns of product_id and order_id then merge with products.csv with intersecting column as product_id##

In [18]:
order_products = pd.concat([order_products__prior,order_products__train])
order_products.shape

(33819106, 4)

In [19]:
order_products.head()

   order_id  product_id  add_to_cart_order  reordered
0         2       33120                  1          1
1         2       28985                  2          1
2         2        9327                  3          0
3         2       45918                  4          1
4         2       30035                  5          0

In [0]:
assert len(order_products) == len(order_products__prior) + len(order_products__train)

In [0]:
# merged2 = pd.merge(products,order_products, how='inner',on='product_id')

In [0]:
# merged2.head()

In [0]:
merged = pd.merge(products[['product_id','product_name']],order_products[['order_id','product_id']])

In [24]:
merged.head(10)

   product_id                product_name  order_id
0           1  Chocolate Sandwich Cookies      1107
1           1  Chocolate Sandwich Cookies      5319
2           1  Chocolate Sandwich Cookies      7540
3           1  Chocolate Sandwich Cookies      9228
4           1  Chocolate Sandwich Cookies      9273
5           1  Chocolate Sandwich Cookies      9696
6           1  Chocolate Sandwich Cookies     11140
7           1  Chocolate Sandwich Cookies     11485
8           1  Chocolate Sandwich Cookies     12672
9           1  Chocolate Sandwich Cookies     13668

In [25]:
merged.tail(10)

          product_id            product_name  order_id
33819096       49688  Fresh Foaming Cleanser   3106363
33819097       49688  Fresh Foaming Cleanser   3111954
33819098       49688  Fresh Foaming Cleanser   3122003
33819099       49688  Fresh Foaming Cleanser   3166828
33819100       49688  Fresh Foaming Cleanser   3290206
33819101       49688  Fresh Foaming Cleanser   3401313
33819102       49688  Fresh Foaming Cleanser    655800
33819103       49688  Fresh Foaming Cleanser   2198380
33819104       49688  Fresh Foaming Cleanser   2508423
33819105       49688  Fresh Foaming Cleanser   2986153

In [26]:
merged['product_name'].value_counts()

Banana                                                        491291
Bag of Organic Bananas                                        394930
Organic Strawberries                                          275577
Organic Baby Spinach                                          251705
Organic Hass Avocado                                          220877
Organic Avocado                                               184224
Large Lemon                                                   160792
Strawberries                                                  149445
Limes                                                         146660
Organic Whole Milk                                            142813
Organic Raspberries                                           142603
Organic Yellow Onion                                          117716
Organic Garlic                                                113936
Organic Zucchini                                              109412
Organic Blueberries                                           105026
Cucumber Kirby                                                 99728
Organic Fuji Apple                                             92889
Organic Lemon                                                  91251
Organic Grape Tomatoes                                         88078
Apple Honeycrisp Organic                                       87272
Seedless Red Grapes                                            86748
Organic Cucumber                                               85005
Honeycrisp Apple                                               83320
Organic Baby Carrots                                           80493
Sparkling Water Grapefruit                                     79245
Organic Half & Half                                            79006
Organic Large Extra Fancy Fuji Apple                           78056
Yellow Onions                                                  76929
Organic Baby Arugula                                           75752
Organic Gala Apples                                            75655
                                                               ...
Vegan Coconut Milk Caramels With Sea Salt                          1
Drink Distinct All Natural Soda Pineapple Coconut & Nutmeg         1
Seasoned Southern Style Red Beans And Rice                         1
Chocolate Peppermint Tart                                          1
Midnight Brownie Cookies                                           1
Peachtree Schnapps                                                 1
Cld/Flu Van Chrry                                                  1
Orange Flavored Ice Cubes                                          1
Ultra Sun Blossom Liquid 90 loads Fabric Enhancers                 1
Escapes Variety Pack                                               1
Indulgent Cherry & Dark Chocolate Whole Milk Greek Yogurt          1
Organic Veggie Ground                                              1
Indian Wells Merlot                                                1
Frittata, Farmer's Market                                          1
Pure Performance Restorative Shampoo Chamomile & Honey             1
Pappardelle Nests Pasta                                            1
Bite Size Caramel Chocolates                                       1
Pure Squeezed  Lemonade                                            1
Hennepin Farmhouse Ale                                             1
Pasta Shapes In Tomato Sauce                                       1
Sloppy Joe Sandwich Makers                                         1
Max White With Polishing Star Soft Toothbrush                      1
Piquillo & Jalapeno Bruschetta                                     1
Brut Prosecco                                                      1
Anjou Pear Hand Soap                                               1
Vitamin D Gummies                                                  1
Cabernet Sauvignon 2015                                            1
Thick 'n Chunky Salsa Mild                                         1
Berry Sprouted Blend Cereal                                        1
Kb Clb Stick Organic Fmly                                          1
Name: product_name, Length: 49685, dtype: int64

#Reshape Data Section

* Replicate the lesson code
* Complete the code cells we skipped near the beginning of the notebook
* Table 2 --> Tidy
* Tidy --> Table 2
* Load seaborn's flights dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
%matplotlib inline
import pandas as pd
import numpy as np
import seaborn as sns

In [0]:
table1=pd.DataFrame([[np.nan, 2],[16,11],[3,1]],index=['John Smith','Jane Doe','Mary Johnson'],columns=['treatmenta','treatmentb'])
table2=table1.T

In [39]:
table1

              treatmenta  treatmentb
John Smith           NaN           2
Jane Doe            16.0          11
Mary Johnson         3.0           1

In [42]:
table2

            John Smith  Jane Doe  Mary Johnson
treatmenta         NaN      16.0           3.0
treatmentb         2.0      11.0           1.0

In [0]:
table1=table1.reset_index()

In [45]:
tidy=table1.melt(id_vars='index')
tidy.columns=['name','trt','results']
tidy

           name         trt  results
0    John Smith  treatmenta      NaN
1      Jane Doe  treatmenta     16.0
2  Mary Johnson  treatmenta      3.0
3    John Smith  treatmentb      2.0
4      Jane Doe  treatmentb     11.0
5  Mary Johnson  treatmentb      1.0

In [46]:
table1['index'].value_counts()

Jane Doe        1
John Smith      1
Mary Johnson    1
Name: index, dtype: int64

##Table 2-> Tidy2

In [0]:
table2=table2.reset_index()

In [50]:
table2

        index  John Smith  Jane Doe  Mary Johnson
0  treatmenta         NaN      16.0           3.0
1  treatmentb         2.0      11.0           1.0

In [56]:
tidy2=table2.melt(id_vars='index')
tidy2.columns=['treatment','name','results']
tidy2

    treatment          name  results
0  treatmenta    John Smith      NaN
1  treatmentb    John Smith      2.0
2  treatmenta      Jane Doe     16.0
3  treatmentb      Jane Doe     11.0
4  treatmenta  Mary Johnson      3.0
5  treatmentb  Mary Johnson      1.0

##Tidy2->Table2

In [59]:
tidy2.pivot_table(index='treatment', columns='name',values='results')

name        Jane Doe  John Smith  Mary Johnson
treatment
treatmenta      16.0         NaN           3.0
treatmentb      11.0         2.0           1.0

Load seaborn's flights dataset by running the cell below. Then create a pivot table showing the number of passengers by month and year. Use year for the index and month for the columns. You've done it right if you get 112 passengers for January 1949 and 432 passengers for December 1960.

In [0]:
flights = sns.load_dataset('flights')

In [64]:
flights.head()

   year     month  passengers
0  1949   January         112
1  1949  February         118
2  1949     March         132
3  1949     April         129
4  1949       May         121

In [65]:
flights.shape

(144, 3)

In [67]:
flights.pivot_table(index='year',columns='month',values='passengers')

month  January  February  March  April  ...  September  October  November  December
year                                    ...
1949       112       118    132    129  ...        136      119       104       118
1950       115       126    141    135  ...        158      133       114       140
1951       145       150    178    163  ...        184      162       146       166
1952       171       180    193    181  ...        209      191       172       194
1953       196       196    236    235  ...        237      211       180       201
1954       204       188    235    227  ...        259      229       203       229
1955       242       233    267    269  ...        312      274       237       278
1956       284       277    317    313  ...        355      306       271       306
1957       315       301    356    348  ...        404      347       305       336
1958       340       318    362    348  ...        404      359       310       337
1959       360       342    406    396  ...        463      407       362       405
1960       417       391    419    461  ...        508      461       390       432

[12 rows x 12 columns]

In [0]:
# order_products[order_products['order_id'] == 2539329]

In [0]:
# bana = final[final['product name']=='Banana']
# bag_o_bana = subset[subset['product_name']=='Bag of Organic Bananas']
# o_strawb = subset[subset['product_name']=='Organic Strawberries']
# o_b_spin = subset[subset['product_name']=='Organic Baby Spinach']
# o_h_avoc = subset[subset['product_name']=='Organic Hass Avocado']
# o_avoc = subset[subset['product_name']=='Organic Avocado']
# l_lemo = subset[subset['product_name']=='Large Lemon']
# strawb = subset[subset['product_name']=='Strawberries']
# limes = subset[subset['product_name']=='Limes']
# o_w_milk = subset[subset['product_name']=='Organic Whole Milk']

In [0]:
# bana.head()

In [0]:
# bana.shape, bag_o_bana.shape,o_strawb.shape,o_b_spin.shape,o_h_avoc.shape,o_avoc.shape,l_lemo.shape,strawb.shape,limes.shape,o_w_milk.shape

In [0]:
# -rw-r--r-- 1 502 staff 2.6K May  2  2017 aisles.csv
# -rw-r--r-- 1 502 staff  270 May  2  2017 departments.csv
# -rw-r--r-- 1 502 staff 551M May  2  2017 order_products__prior.csv
# -rw-r--r-- 1 502 staff  24M May  2  2017 order_products__train.csv
# -rw-r--r-- 1 502 staff 104M May  2  2017 orders.csv
# -rw-r--r-- 1 502 staff 2.1M May  2  2017 products.csv

In [0]:
##### YOUR CODE HERE #####

## Join Data Stretch Challenge

The [Instacart blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2) has a visualization of "**Popular products** purchased earliest in the day (green) and latest in the day (red)." 

The post says,

> "We can also see the time of day that users purchase specific products.

> Healthier snacks and staples tend to be purchased earlier in the day, whereas ice cream (especially Half Baked and The Tonight Dough) are far more popular when customers are ordering in the evening.

> **In fact, of the top 25 latest ordered products, the first 24 are ice cream! The last one, of course, is a frozen pizza.**"

Your challenge is to reproduce the list of the top 25 latest ordered popular products.

We'll define "popular products" as products with more than 2,900 orders.

## Reshape Data Stretch Challenge

_Try whatever sounds most interesting to you!_

- Replicate more of Instacart's visualization showing "Hour of Day Ordered" vs "Percent of Orders by Product"
- Replicate parts of the other visualization from [Instacart's blog post](https://tech.instacart.com/3-million-instacart-orders-open-sourced-d40d29ead6f2), showing "Number of Purchases" vs "Percent Reorder Purchases"
- Get the most recent order for each user in Instacart's dataset. This is a useful baseline when [predicting a user's next order](https://www.kaggle.com/c/instacart-market-basket-analysis)
- Replicate parts of the blog post linked at the top of this notebook: [Modern Pandas, Part 5: Tidy Data](https://tomaugspurger.github.io/modern-5-tidy.html)